# SQLITE
SQLite es una herramienta de software libre, que permite almacenar información en dispositivos empotrados de una forma sencilla, eficaz, potente, rápida y en equipos con pocas capacidades de hardware, como puede ser una PDA o un teléfono celular. SQLite implementa el estándar SQL92 y también agrega extensiones que facilitan su uso en cualquier ambiente de desarrollo. Esto permite que SQLite soporte desde las consultas más básicas hasta las más complejas del lenguaje SQL, y lo más importante es que se puede usar tanto en dispositivos móviles como en sistemas de escritorio, sin necesidad de realizar procesos complejos de importación y exportación de datos, ya que existe compatibilidad al 100% entre las diversas plataformas disponibles, haciendo que la portabilidad entre dispositivos y plataformas sea transparente.

SQLite es un sencillo sistema de gestión de bases de datos de tipo relacional que está escrito en lenguaje C, que implementa el estándar del lenguaje de consulta SQL-92.

SQlite no funciona como otros gestores que necesitan de un servidor de base de datos ejecutándose en un proceso separado al que se le hacen peticiones. La librería SQLite es tan pequeña que se enlaza con los programas y éstos hacen llamadas directamente a los procedimientos y funciones disponibles para interactuar con las bases de datos; siendo este modo de trabajo más eficiente que el basado en comunicar peticiones a procesos externos.

Una base de datos SQLite se almacena en un sólo archivo y, siempre que sea posible, funcionará completamente en memoria para mejorar su rendimiento. Además, como no tiene dependencias externas es fácilmente portable y convertible.

SQLite tiene licencia GPL, está disponible para las plataformas más extendidas (GNU/Linux, Windows, MacOSX) y cuenta con librerías y drivers para desarrollar bases de datos con los lenguajes de programación más populares (Python, Perl, Java, Ruby, PHP, C, etc.

In [ ]:
import sqlite3 as sql

In [ ]:
conn = sql.connect('bd.sqlite')

In [ ]:
conn

In [ ]:
cursor = conn.cursor()

In [ ]:
cursor.execute("""

  CREATE TABLE Writer(
      FirstName VARCHAR(50) NOT NULL,
      LastName VARCHAR(50) NOT NULL,  
      USERID int  NOT NULL UNIQUE, 
      PRIMARY KEY (USERID)
   )   

""")

In [ ]:
cursor.execute("""

  SELECT * FROM Writer

""")
cursor.fetchall()

[]

In [ ]:
cursor.execute("""

  INSERT INTO Writer VALUES 
    ('William', 'Shakespeare', 1616),
    ('Lin', 'Han', 1996),
    ('Peter', 'Brecht', 1978);

""")

In [ ]:
cursor.execute("""

  SELECT * FROM Writer

""")
cursor.fetchall()

[('William', 'Shakespeare', 1616),
 ('Lin', 'Han', 1996),
 ('Peter', 'Brecht', 1978)]

In [ ]:
import pandas as pd

In [ ]:
df = pd.read_sql_query("SELECT * FROM Writer", conn)

In [ ]:
conn.close()

In [ ]:
df

  FirstName     LastName  USERID
0   William  Shakespeare    1616
1       Lin          Han    1996
2     Peter       Brecht    1978

DATASET Películas

In [ ]:
movie = pd.read_csv("/content/drive/MyDrive/Mentorias/ID-Eric/Dataset Peliculas/movie.csv", sep = ' *, *')
gender = pd.read_csv("/content/drive/MyDrive/Mentorias/ID-Eric/Dataset Peliculas/gender.csv", sep = ' *, *')
actor = pd.read_csv("/content/drive/MyDrive/Mentorias/ID-Eric/Dataset Peliculas/actor.csv", sep = ' *, *')
ma = pd.read_csv("/content/drive/MyDrive/Mentorias/ID-Eric/Dataset Peliculas/ma.csv", sep = ' *, *')

In [ ]:
movie.drop('Unnamed: 0', axis = 1, inplace = True)
ma.drop('Unnamed: 0', axis = 1, inplace = True)
actor.drop('Unnamed: 0', axis = 1, inplace = True)
gender.drop('Unnamed: 0', axis = 1, inplace = True)

In [ ]:
movie.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 28 entries, 0 to 27
Data columns (total 8 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   mov_id           28 non-null     int64
 1   mov_title        28 non-null     object
 2   mov_year         28 non-null     int64
 3   mov_time         28 non-null     int64
 4   mov_lang         28 non-null     object
 5   mov_dt_rel       25 non-null     object
 6   mov_rel_country  28 non-null     object
 7   genero           28 non-null     int64
dtypes: int64(4), object(4)
memory usage: 1.9+ KB

In [ ]:
conn = sql.connect('Peliculas.sqlite')

In [ ]:
cursor = conn.cursor()

In [ ]:
movie.to_sql("Movie", conn, if_exists = "replace")
actor.to_sql("Actor", conn, if_exists = "replace")
gender.to_sql("Gender", conn, if_exists = "replace")
ma.to_sql("Movie_Actor", conn, if_exists = "replace")

In [ ]:
cursor.execute("SELECT name FROM sqlite_master WHERE type='table';")
print(cursor.fetchall())

[('Movie',), ('Actor',), ('Gender',), ('Movie_Actor',)]

In [ ]:
cursor.execute("""

  SELECT * FROM Movie

""")
cursor.fetchall()

[(0, 901, 'Vertigo', 1958, 128, 'English', '1958-08-24', 'UK', 1010),
 (1, 902, 'The Innocents', 1961, 100, 'English', '1962-02-19', 'SW', 1008),
 (2,
  903,
  'Lawrence of Arabia',
  1962,
  216,
  'English',
  '1962-12-11',
  'UK',
  1002),
 (3, 904, 'The Deer Hunter', 1978, 183, 'English', '1979-03-08', 'UK', 1013),
 (4, 905, 'Amadeus', 1984, 160, 'English', '1985-01-07', 'UK', 1004),
 (5, 906, 'Blade Runner', 1982, 117, 'English', '1982-09-09', 'UK', 1012),
 (6, 907, 'Eyes Wide Shut', 1999, 159, 'English', None, 'UK', 1010),
 (7,
  908,
  'The Usual Suspects',
  1995,
  106,
  'English',
  '1995-08-25',
  'UK',
  1006),
 (8, 909, 'Chinatown', 1974, 130, 'English', '1974-08-09', 'UK', 1001),
 (9, 910, 'Boogie Nights', 1997, 155, 'English', '1998-02-16', 'UK', 1005),
 (10, 911, 'Annie Hall', 1977, 93, 'English', '1977-04-20', 'USA', 1005),
 (11,
  912,
  'Princess Mononoke',
  1997,
  134,
  'Japanese',
  '2001-10-19',
  'UK',
  1003),
 (12,
  913,
  'The Shawshank Redemption',
  1994,
  142,
  'English',
  '1995-02-17',
  'UK',
  1006),
 (13, 914, 'American Beauty', 1999, 122, 'English', None, 'UK', 1011),
 (14, 915, 'Titanic', 1997, 194, 'English', '1998-01-23', 'UK', 1007),
 (15,
  916,
  'Good Will Hunting',
  1997,
  126,
  'English',
  '1998-06-03',
  'UK',
  1007),
 (16, 917, 'Deliverance', 1972, 109, 'English', '1982-10-05', 'UK', 1002),
 (17, 918, 'Trainspotting', 1996, 94, 'English', '1996-02-23', 'UK', 1007),
 (18, 919, 'The Prestige', 2006, 130, 'English', '2006-11-10', 'UK', 1002),
 (19, 920, 'Donnie Darko', 2001, 113, 'English', None, 'UK', 1007),
 (20,
  921,
  'Slumdog Millionaire',
  2008,
  120,
  'English',
  '2009-01-09',
  'UK',
  1007),
 (21, 922, 'Aliens', 1986, 137, 'English', '1986-08-29', 'UK', 1001),
 (22, 923, 'Beyond the Sea', 2004, 118, 'English', '2004-11-26', 'UK', 1009),
 (23, 924, 'Avatar', 2009, 162, 'English', '2009-12-17', 'UK', 1002),
 (24, 926, 'Seven Samurai', 1954, 207, 'Japanese', '1954-04-26', 'JP', 1007),
 (25, 927, 'Spirited Away', 2001, 125, 'Japanese', '2003-09-12', 'UK', 1010),
 (26,
  928,
  'Back to the Future',
  1985,
  116,
  'English',
  '1985-12-04',
  'UK',
  1007),
 (27, 925, 'Braveheart', 1995, 178, 'English', '1995-09-08', 'UK', 1007)]

In [ ]:
cursor.execute("""

  SELECT * FROM Actor WHERE act_gender = 'M'

""")
cursor.fetchall()

[(0, 101, 'James', 'Stewart', 'M'),
 (2, 103, 'Peter', 'OToole', 'M'),
 (3, 104, 'Robert', 'De Niro', 'M'),
 (4, 105, 'F. Murray', 'Abraham', 'M'),
 (5, 106, 'Harrison', 'Ford', 'M'),
 (7, 108, 'Stephen', 'Baldwin', 'M'),
 (8, 109, 'Jack', 'Nicholson', 'M'),
 (9, 110, 'Mark', 'Wahlberg', 'M'),
 (10, 111, 'Woody', 'Allen', 'M'),
 (12, 113, 'Tim', 'Robbins', 'M'),
 (13, 114, 'Kevin', 'Spacey', 'M'),
 (15, 116, 'Robin', 'Williams', 'M'),
 (16, 117, 'Jon', 'Voight', 'M'),
 (17, 118, 'Ewan', 'McGregor', 'M'),
 (18, 119, 'Christian', 'Bale', 'M'),
 (20, 121, 'Dev', 'Patel', 'M'),
 (22, 123, 'David', 'Aston', 'M')]

In [ ]:
#Nombre del actor que tiene más películas
cursor.execute("""

    SELECT act_fname, act_lname FROM (SELECT act_id, COUNT(mov_id) AS count 
    FROM movie_actor GROUP BY act_id ORDER BY count DESC LIMIT 1) AS t1 
    INNER JOIN Actor AS t2 ON t1.act_id = t2.act_id
  

""")
cursor.fetchall()

[('Kevin', 'Spacey')]

In [ ]:
cursor.execute("""

    SELECT * FROM Movie t1 
    INNER JOIN 
    Gender t2 on t1.genero = t2.gen_id WHERE t2.gen_title = 'Drama'
    ORDER BY mov_title ASC LIMIT 2
  

""")
cursor.fetchall()

[(26,
  928,
  'Back to the Future',
  1985,
  116,
  'English',
  '1985-12-04',
  'UK',
  1007,
  6,
  1007,
  'Drama'),
 (27,
  925,
  'Braveheart',
  1995,
  178,
  'English',
  '1995-09-08',
  'UK',
  1007,
  6,
  1007,
  'Drama')]